// Info / System
"Unlock" = "解锁";
"System" = "系统";
"Serial" = "序列号生成器";
"Model" = "机型";
"Peripherals" = "杂项";
"Name" = "名称";
"Value" = "值";
"System Info" = "系统信息";
"Host" = "主机名称";
"OS" = "系统";
"Kernel" = "内核";
"RAM" = "内存";
"Model Identifier" = "机型";
"CPU" = "CPU";
"Intel Generation" = "Intel 架构";
"Platform ID" = "平台 ID";
"Board ID" = "Board ID";
"Serial Number" = "序列号";
"Hardware UUID" = "硬件 UUID";
"System ID" = "系统 ID";
"ROM" = "ROM";
"Board Serial Number" = "主板序列号";
"VDA Decoder" = "VDA 解码器";
"GPU Info:" = "GPU 信息：";
"GPU Name" = "图形卡";
"GPU Device ID" = "设备 ID";
"Total VRAM" = "总的 VRAM";
"Free VRAM" = "剩余的 VRAM";
"Quartz Extreme (QE/CI)" = "硬件加速 (QE/CI)";
"Metal Supported" = "Metal 支持";
"Metal Device Name" = "Metal 设备名称";
"Metal Default Device" = "Metal 默认设备";
"Metal Low Power" = "Metal 低功耗";
"Metal Headless" = "Metal 无输出";
"iMessage Keys" = "iMessage 键值";
"Check Serial (EveryMac.com)" = "检查序列号 (EveryMac.com)";
"Check Serial (Apple.com)" = "检查序列号 (Apple.com)";
"Serial Info" = "序列号信息";
"Export" = "导出";
"Country" = "国家";
"Year" = "年份";
"Week" = "周";
"Line" = "产线代码";
"Valid" = "有效";
"Possibly" = "可能";
"Unlikely" = "不太可能";
// Info / Serial Generator
"Serial Generator Info:" = "生成序列号信息:";
// Info / Model
"Model Info:" = "设备信息：";
"2nd Disp Support" = "第二显示器支持";
"2nd Max Res" = "第二显示器最高分辨率";
"Apple Subfamily" = "苹果子家族";
"Architecture" = "架构";
"Avg Weight" = "平均质量";
"Battery Life" = "电池寿命";
"Battery Type" = "电池类型";
"Cache Bus Speed" = "缓存总线速度";
"Case Type" = "外壳类型";
"Custom Speeds" = "自定义速度";
"Dimensions" = "外型尺寸";
"Discontinued Date" = "停止支持日期";
"Display" = "显示器";
"EFI Architecture" = "EFI 架构";
"EMC Number" = "EMC 码";
"Est Current Retail" = "当前 Est 零售价";
"Expansion Bays" = "扩展坞";
"Expansion Slots" = "扩展插槽";
"Firewire" = "火线";
"Firewire Support" = "火线支持";
"Geekbench 2 32" = "Geekbench 2 32";
"Geekbench 2 64" = "Geekbench 2 64";
"Geekbench 3 MC 32" = "Geekbench 3 MC 32";
"Geekbench 3 MC 64" = "Geekbench 3 MC 64";
"Geekbench 3 SC 32" = "Geekbench 3 SC 32";
"Geekbench 3 SC 64" = "Geekbench 3 SC 64";
"Geekbench 4 MC" = "Geekbench 4 MC";
"Geekbench 4 SC" = "Geekbench 4 SC";
"Input Type" = "输入类型";
"Int HD Interface" = "Int HD Interface";
"Introduction Date" = "发布日期";
"Keyboard Type" = "键盘类型";
"L1 Cache" = "L1 缓存";
"L2 Cache" = "L2 缓存";
"Mac OS 9 Support" = "支持 Mac OS 9";
"Maximum OS" = "最低 OS";
"Maximum RAM" = "最大内存";
"Maximum VRAM" = "最大显存";
"Maximum Windows" = "最高 Windows";
"Min. RAM Speed" = "最小内存速度";
"Minimum Windows" = "最低 Windows";
"Model" = "型号";
"Model Identifier" = "型号标识符";
"Model Number" = "型号编码";
"Motherboard RAM" = "板载内存";
"Order Number" = "Order 码";
"Original OS" = "出厂 OS";
"Original Price" = "原始价格";
"Processor Speed" = "处理器速度";
"Processor Type" = "处理器类型";
"Processor Upgrade" = "处理器升级性";
"Processors (Cores)" = "处理器数 (核心数)";
"RAM Slots" = "内存插槽";
"RAM Type" = "内存类型";
"Resolution" = "分辨率";
"ROM/Firmware" = "固件";
"Standard AirPort" = "AirPort 标准";
"Standard Bluetooth" = "蓝牙标准";
"Standard Ethernet" = "网络接口标准";
"Standard HD" = "硬盘标准";
"Standard Optical" = "光学标准";
"Standard RAM" = "内存标准";
"Standard VRAM" = "显存标准";
"System Bus Speed" = "系统总线速度";
"Turbo Boost" = "睿频";
"Url" = "Url 链接";
"USB" = "USB";
"Video Card" = "图形卡";
"Video Port" = "图形接口";
"VRAM Type" = "显存类型";
"Windows Support" = "Windows 支持";
"Model:" = "设备：";
"Visit EveryMac" = "前往 EveryMac";
"Visit" = "前往";
// Info / Misc
"Network Interfaces:" = "网络接口:";
"Vendor " = "供应商";
"Vendor Name" = "供应商名称";
"Device Name" = "设备名称";
"BSD Name" = "BSD 名称";
"Builtin" = "内建";
"Bluetooth Devices:" = "蓝牙设备:";
"FW Loaded" = "固件已加载";
"Graphic Devices:" = "显示设备：";
"Ports" = "接口";
"Sub Device" = "子设备";
"Codec" = "Codec";
"Revision" = "修订值";
"Storage Devices:" = "存储设备:";
"Model" = "型号";
"Location" = "位置";
"Phy Block" = "物理块大小";
// Menu
"About Hackintool" = "关于 Hackintool";
"Check for Updates..." = "检查更新...";
"Preferences…" = "偏好设置…";
"Services" = "服务";
"Hide Hackintool" = "隐藏 Hackintool";
"Hide Others" = "隐藏其他";
"Quit Hackintool" = "退出 Hackintool";
"File" = "文件";
"Open…" = "打开";
"Open Recent" = "打开最近的文件";
"Generate Audio Codecs Info" = "生成声卡 Codec 信息";
"Import" = "导入";
"Export" = "导出";
"IOReg Dump (Native)" = "IOReg 导出 (原始)";
"IOReg Dump (Patched)" = "IOReg 导出 (已修补)";
"Bootloader config.plist" = "引导工具 Config.plist";
"Framebuffer Text" = "缓冲帧文本格式";
"Framebuffer Binary" = "缓冲帧二进制格式";
"Edit" = "编辑";
"Cut" = "剪切";
"Copy" = "拷贝";
"Paste" = "粘贴";
"Paste and Match Style" = "粘贴并匹配样式";
"Select All" = "全选";
"Find" = "查找";
"Find…" = "查找…";
"Find and Replace…" = "查找并替换…";
"Find Next" = "查找下一个";
"Find Previous" = "查找上一个";
"Use Selection for Find" = "查找所选内容";
"Jump to Selection" = "跳到所选内容";
"Spelling and Grammar" = "拼写和语法";
"Check Document Now" = "立即检查文稿";
"Check Spelling While Typing" = "键入时检查拼写";
"Check Grammar With Spelling" = "检查拼写和语法";
"Correct Spelling Automatically" = "自动纠正拼写";
"Substitutions" = "替换";
"Show Substitutions" = "显示替换";
"Smart Copy/Paste" = "智能拷贝/粘贴";
"Smart Quotes" = "智能引号";
"Smart Dashes" = "智能破折号";
"Smart Links" = "智能连接";
"Data Detectors" = "数据检测器";
"Text Replacement" = "文本替换";
"Transformations" = "转换";
"Make Upper Case" = "变为大写";
"Make Lower Case" = "变为小写";
"Capitalize" = "首字母大写";
"Speech" = "语音";
"Start Speaking" = "开始朗读";
"Stop Speaking" = "停止朗读";
"Show Toolbar" = "显示工具栏";
"Hide Toolbar" = "隐藏工具栏";
"Customize Toolbar…" = "自定义工具栏…";
"View" = "显示";
"Window" = "窗口";
"Help" = "帮助";
"Current Version" = "当前版本";
"System Configs" = "台式机核显补丁集";
"Apply Current Patches" = "应用当前补丁";
"Minimize" = "最小化";
"Zoom" = "缩放";
"Bring All to Front" = "前置全部窗口";
"Hackintool Help" = "Hackintool 帮助";
// Tabs
"Info" = "信息";
"Patch" = "补丁";
"Bootloader" = "引导工具";
"NVRAM" = "NVRAM";
"Extensions" = "内核扩展";
"Displays" = "显示器";
"Sound" = "音频";
"USB" = "USB";
"Disks" = "磁盘";
"PCIe" = "PCIe";
"Power" = "电源";
"Calc" = "计算器";
"Utilities" = "工具";
"Logs" = "日志";
// Patch
"Intel Generation:" = "CPU 架构: ";
"Platform ID:" = "平台 ID：";
"Info" = "信息";
"Framebuffer" = "缓冲帧";
"Connectors" = "接口";
"Patch" = "应用补丁";
"Go To Current" = "转到当前";
"Reload" = "重新加载";
// Patch / Selected Framebuffer Info
"Selected Framebuffer" = "选中的缓冲帧信息";
"Intel Generation" = "CPU 架构";
"Platform ID" = "平台 ID";
"GPU Name" = "图形卡";
"Mobile" = "移动端";
"GPU Device ID(s)" = "图形卡设备 ID";
"Model(s)" = "SMBIOS 机型";
// Patch / Current Framebuffer Info
"Current Framebuffer" = "当前缓冲帧信息：";
// Patch / VRAM Info
"VRAM Info:" = "显存信息：";
"Stolen" = "动态显存";
"FBMem" = "缓冲帧显存";
"VRAM" = "基本显存";
"Max Stolen" = "最大动态显存";
"Total Stolen" = "动态显存总计";
"Total Cursor" = "Cursor 总计";
"Max Overall" = "最大占用总计";
// Patch / Framebuffer
"Framebuffer Info:" = "缓冲帧信息：";
"FramebufferID" = "缓冲帧 ID";
"ModelNameAddr" = "型号名称地址";
"Mobile" = "移动端";
"PipeCount" = "通道数";
"PortCount" = "接口数";
"FBMemoryCount" = "缓冲帧显存数";
"StolenMemorySize" = "动态显存大小";
"FramebufferMemorySize" = "缓冲帧显存大小";
"CursorMemorySize" = "Cursor 显存大小";
"UnifiedMemorySize" = "总显存大小";
"BacklightFrequency" = "背光频率";
"BacklightMax" = "最大背光";
"Flags" = "标识符";
"BTTableOffsetIndexSlice" = "BTTableOffsetIndexSlice";
"BTTableOffsetIndexNormal" = "BTTableOffsetIndexNormal";
"BTTableOffsetIndexHDMI" = "BTTableOffsetIndexHDMI";
"CamelliaVersion" = "Camellia 版本";
"NumTransactionsThreshold" = "NumTransactionsThreshold";
"VideoTurboFreq" = "VideoTurbo 频率";
"BTTArraySliceAddr" = "BTTArraySliceAddr";
"BTTArrayNormalAddr" = "BTTArrayNormalAddr";
"BTTArrayHDMIAddr" = "BTTArrayHDMIAddr";
"SliceCount" = "SliceCount";
"EuCount" = "EuCount";
"Disabled" = "已禁用";
"V1" = "V1";
"V2" = "V2";
"V3" = "V3";
"Unsupported" = "不支持";
"Index" = "索引";
"BusID" = "总线 ID";
"Pipe" = "通道";
"Type" = "类型";
"Flags" = "标识符";
"Zero" = "Zero";
"Dummy" = "不存在";
"LVDS" = "LVDS";
"DigitalDVI" = "数字 DVI";
"SVID" = "SVID";
"VGA" = "VGA";
"DP" = "DP";
"HDMI" = "HDMI";
"AnalogDVI" = "模拟 DVI";
"Framebuffer Flags:" = "缓冲帧标识符：";
"FBAvoidFastLinkTraining" = "FBAvoidFastLinkTraining";
"FBFramebufferCommonMemory" = "FBFramebufferCommonMemory";
"FBFramebufferCompression" = "FBFramebufferCompression";
"FBEnableSliceFeatures" = "FBEnableSliceFeatures";
"FBDynamicFBCEnable" = "FBDynamicFBCEnable";
"FBUseVideoTurbo" = "FBUseVideoTurbo";
"FBForcePowerAlwaysConnected" = "FBForcePowerAlwaysConnected";
"FBDisableHighBitrateMode2" = "FBDisableHighBitrateMode2";
"FBBoostPixelFrequencyLimit" = "FBBoostPixelFrequencyLimit";
"FBLimit4KSourceSize" = "FBLimit4KSourceSize";
"FBAlternatePWMIncrement1" = "FBAlternatePWMIncrement1";
"FBAlternatePWMIncrement2" = "FBAlternatePWMIncrement2";
"FBDisableFeatureIPS" = "FBDisableFeatureIPS";
"FBUnknownFlag_2000" = "FBUnknownFlag_2000";
"FBAllowConnectorRecover" = "FBAllowConnectorRecover";
"FBUnknownFlag_8000" = "FBUnknownFlag_8000";
"FBUnknownFlag_10000" = "FBUnknownFlag_10000";
"FBUnknownFlag_20000" = "FBUnknownFlag_20000";
"FBDisableGFMPPFM" = "FBDisableGFMPPFM";
"FBUnknownFlag_80000" = "FBUnknownFlag_80000";
"FBUnknownFlag_100000" = "FBUnknownFlag_100000";
"FBEnableDynamicCDCLK" = "FBEnableDynamicCDCLK";
"FBUnknownFlag_400000" = "FBUnknownFlag_400000";
"FBSupport5KSourceSize" = "FBSupport5KSourceSize";
"FBUnknownZeroFlags" = "FBUnknownZeroFlags";
"CNAlterAppertureRequirements" = "CNAlterAppertureRequirements";
"CNUnknownFlag_2" = "CNUnknownFlag_2";
"CNUnknownFlag_4" = "CNUnknownFlag_4";
"CNConnectorAlwaysConnected" = "CNConnectorAlwaysConnected";
"CNUnknownFlag_10" = "CNUnknownFlag_10";
"CNUnknownFlag_20" = "CNUnknownFlag_20";
"CNDisableBlitTranslationTable" = "CNDisableBlitTranslationTable";
"CNUseMiscIoPowerWell" = "CNUseMiscIoPowerWell";
"CNUsePowerWell2" = "CNUsePowerWell2";
"CNUnknownFlag_200" = "CNUnknownFlag_200";
"CNUnknownFlag_400" = "CNUnknownFlag_400";
"CNUnknownFlag_800" = "CNUnknownFlag_800";
"CNUnknownFlag_1000" = "CNUnknownFlag_1000";
"CNUnknownFlag_2000" = "CNUnknownFlag_2000";
"CNUnknownFlag_4000" = "CNUnknownFlag_4000";
"CNUnknownFlag_8000" = "CNUnknownFlag_8000";
"CNUnknownZeroFlags" = "CNUnknownZeroFlags";
// Patch Options / Advanced ToolTips
"TT_DVMTPreAlloc32MB" = "将 DVMT 预分配设置为 32MB 以匹配 BIOS 设置(动态显存 = 19MB / 缓冲帧显存 = 9 MB)";
"TT_VRAM2048MB" = "将显存设置为 2048MB, 可以修复某些 4K 显示器的显示问题(总内存 = 2048MB)";
"TT_DisableeGPU" = "禁用独立显卡 (disable-external-gpu)";
"TT_EnableHDMI20" = "高分屏中为 HDMI 启用 60Hz (enable-hdmi20)";
"TT_DPtoHDMI" = "将 DP 转换为 HDMI";
"TT_GfxYTileFix" = "自 macOS Sierra 10.12 更新以来，Skylake 的 Intel HD 530 核显在菜单栏和其他位置的左上角的某些图形上会有瑕疵或“毛刺”。在 OS X El Capitan 下不会发生这种情况。 (AAPL,GfxYTile)";
"TT_UseIntelHDMI" = "如果为 TRUE，hda-gfx = onboard-1 将被注入到 GFX0 和 HDEF 设备中。 此外，如果存在 ATI 或 Nvidia HDMI 设备，它们将会分配给 onboard-2。 如果为 FALSE，则 ATI 或 Nvidia 设备以及 HDAU 设备（如果存在）将被设置在 onboard-1 上。";
"TT_USBPortLimit" = "在可能的情况下注入 USB 端口限制补丁";
"TT_HotplugRebootFix" = "将连接的通道值设为 18";
"TT_DPCDMaxLinkRate" = "解决某些笔记本电脑（Dell XPS 15 9570 等）上最大链接速率无效的问题。";
"TT_HDMIInfiniteLoopFix" = "修复图形驱动程序尝试建立具有更高像素时钟速率的 HDMI 连接时的无限循环，例如连接到具有 HDMI 1.4 的 2K/4K 显示器，否则系统会挂起（并且您的内置笔记本电脑显示器保持黑色）当您 插入 HDMI 电缆。\r\r- 对于那些希望通过 HDMI 1.4 端口获得“有限”2K/4K 体验（即 2K@59Hz 或 4K@30Hz）的用户，您可能会发现此修复很有用。\ r- 对于笔记本电脑或 PC 的 HDMI 2.0 路由到 IGPU 并且有 HDMI 输出问题的用户，请注意，此修复现在已通过 LSPCON 驱动程序解决方案成功，并且仍然建议启用 LSPCON 驱动程序支持以具有完整的 HDMI 2.0 体验。\r（您可能仍然暂时需要此修复来确定 HDMI 端口的连接器索引。）";
"TT_FramebufferPortLimit" = "将接口的索引设置为 -1 (禁用), 在超过接口数限制时使用";
"TT_SpoofAudioDeviceID" = "在可能时仿冒 HDEF 设备 ID";
"TT_SpoofVideoDeviceID" = "仿冒 HDEF 设备 ID";
"TT_InjectDeviceID" = "仿冒 HDEF 设备 ID";
// Patch Options / LSPCON ToolTips
"TT_LSPCONEnableDriver" = "最近的笔记本电脑（基于 Kaby Lake/Coffee Lake）通常配备 HDMI 2.0 端口。 此端口可以路由到 IGPU 或 DGPU，您可以在 Windows 10 上进行确认。但是，Intel (U)HD Graphics 不提供原生 HDMI 2.0 输出，因此为了解决此问题，OEM 添加了额外的硬件 在主板上命名为 LSPCON 以将 DisplayPort 转换为 HDMI 2.0。\r\rLSPCON 在电平转换器 (LS) 或协议转换器 (PCON) 模式下工作。 当适配器工作在LS模式时，它能够从DisplayPort产生HDMI 1.4信号，而在PCON模式下，它可以提供HDMI 2.0输出。 某些板载 LSPCON 适配器（例如戴尔 XPS 15 9570 上的适配器）已在固件中配置为默认在 LS 模式下工作，导致处理 HDMI 2.0 连接时出现黑屏。\r\r从版本 1.3.0 开始，WhateverGreen 现在 通过自动将适配器配置为在新的 HDMI 连接上以 PCON 模式运行，为板载 LSPCON 提供驱动程序支持，从而解决了某些平台上的黑屏问题。\r\r- LSPCON 驱动程序仅适用于具有 HDMI 2.0 的笔记本电脑和 PC 路由到 IGPU。\r- 所有较新的平台都需要 LSPCON 驱动程序，除非新的 IGPU 开始提供本机 HDMI 2.0 输出。\r- 支持的英特尔平台：Skylake、Kaby Lake、Coffee Lake 及更高版本。\rSkylake 机型：英特尔 NUC 骷髅峡谷； Iris Pro 580 + HDMI 2.0 带 Parade PS175 LSPCON。\rCoffee Lake 机型：一些笔记本电脑，例如 Dell XPS 15 9570，配备 HDMI 2.0 和 Parade PS175 LSPCON。\r- 如果您已确认您的 HDMI 2.0 已路由到 IGPU 并且现在工作正常，则无需启用此驱动程序，因为您的板载 LSPCON 可能已在固件中配置为在 PCON 模式下工作。";
// Framebuffer Flags ToolTips
"TT_FBAvoidFastLinkTraining" = "发现于 AppleIntelFBController::LinkTraining. FastLinkTraining 用于取消.\r根据 joevt, 为 0 的 SKL link training 发生于 450 MHz 或者 540 MHz";
"TT_FBFramebufferCommonMemory" = "设置 minStolenMem 的计算逻辑, 当 fStolenMemorySize 的设定没有被与 \rfFBMemoryCount 相乘, 假设 fStolenMemorySize 一次计算所有缓冲帧。";
"TT_FBFramebufferCompression" = "发现于 AppleIntelFramebufferController::getFeatureControl.\r这相当于在 plist FeatureControl 部分设置 FBC = 1.";
"TT_FBEnableSliceFeatures" = "发现于 AppleIntelFramebufferController::getFeatureControl.\r这相当于在 plist FeatureControl 部分设置 SliceSDEnable = 1，EUSDEnable = 1，DynamicSliceSwitch = 1.";
"TT_FBDynamicFBCEnable" = "发现于 AppleIntelFramebufferController::getFeatureControl.\r这相当于在 plist FeatureControl 部分中设置 DynamicFBCEnable = 1.";
"TT_FBUseVideoTurbo" = "这将设置 fUseVideoTurbo = 1 并从特定字段加载 GPU turbo 频率.\r 默认为 14，可以被 plist FeatureControl 部分中的 VideoTurboFreq 覆盖.";
"TT_FBForcePowerAlwaysConnected" = "发现于 AppleIntelFramebuffer::getDisplayStatus.\r即使在始终连接的显示器上也显示电源复位（请参阅连接器标志 CNConnectorAlwaysConnected）.";
"TT_FBDisableHighBitrateMode2" = "根据 joevt，这强制执行高比特率模式 1，它将 DP 比特率限制为 8.64 Gbit / s 而不是正常的 17.28 Gbit / s(HBR2)。\r我认为这不再用于 Skylake。";
"TT_FBBoostPixelFrequencyLimit" = "这个 bit 在 Broadwell 和更新的设备中没有使用，但在设置 fPortCount> 0 时，即对于所有在线缓冲帧。\rHaswell 中它被 AppleIntelFramebuffer::GetOnlineInfo 使用，并且仅被设置在 0x0D260007（MacBookPro11,3）和 0x0D26000E，这是顶部 模型。\r这似乎将像素频率限制（也称像素时钟）提升到 540000000 赫兹 (从通常的 216000000,320000000,360000000,450000000).";
"TT_FBLimit4KSourceSize" = "发现于 AppleIntelFramebuffer::ValidateSourceSize.\r将视频源大小限制为 4096x4096。";
"TT_FBAlternatePWMIncrement1" = "发现于 AppleIntelFramebufferController::start。\r 这些 Bit 看起来完全等效，可以互换使用。 设置结果：SOUTH_DSPCLK_GATE_D (0xc2020) 中的\r- PCH_LP_PARTITION_LEVEL_DISABLE (1 << 12) Bit 在SOUTH_CHICKEN2 (0xc2004) 中的 LPT_PWM_GRANULARITY (1 << 5) Bit\r详情 Linux 驱动程序源代码 (lpt_init_clock_gating，lpt_enable_backlight).\r这些 Bit 设置背光脉冲宽度模块化，没有内置显示器（即在台式机上）设置它们是没有意义的。";
"TT_FBAlternatePWMIncrement2" = "发现于 AppleIntelFramebufferController::start。\r这些 Bit 看起来完全等效，可以互换使用。 设置结果：SOUTH_DSPCLK_GATE_D (0xc2020) 中的\r- PCH_LP_PARTITION_LEVEL_DISABLE (1 << 12) Bit 在SOUTH_CHICKEN2 (0xc2004) 中的 LPT_PWM_GRANULARITY (1 << 5) Bit\r详情 Linux 驱动程序源代码 (lpt_init_clock_gating，lpt_enable_backlight).\r这些 Bit 设置背光脉冲宽度模块化，没有内置显示器（即在台式机上）设置它们是没有意义的。";
"TT_FBDisableFeatureIPS" = "发现于 Broadwell 的 AppleIntelFBController::start / AppleIntelFBController::getFeatureControl。\r这相当于在 plist FeatureControl 部分设置 DisableFeatureIPS = 1.\rIPS 代表中级像素存储。";
"TT_FBUnknownFlag_2000" = "";
"TT_FBAllowConnectorRecover" = "发现于 Broadwell 的 AppleIntelFBController::getOSInformation。\r 被 AppleIntelFramebufferController::LinkTraining camellia 版本 2 使用。\r可以被 -notconrecover boot-arg 覆盖，它有效地取消了这一 bit。";
"TT_FBUnknownFlag_8000" = "";
"TT_FBUnknownFlag_10000" = "";
"TT_FBUnknownFlag_20000" = "";
"TT_FBDisableGFMPPFM" = "发现于 AppleIntelFramebufferController::getFeatureControl.\r 只有当 plist FeatureControl 部分中的 GFMPPFM 设置为 2 时才会生效，否则 GFMPPFM 将关闭。";
"TT_FBUnknownFlag_80000" = "";
"TT_FBUnknownFlag_100000" = "";
"TT_FBEnableDynamicCDCLK" = "发现于 AppleIntelFramebufferController::getFeatureControl.\r仅当 plist FeatureContro l部分中的 SupportDynamicCDClk 设置为 1 时才会生效，否则关闭。\r同时还需要将 dc6config设置为3（默认值）。";
"TT_FBUnknownFlag_400000" = "";
"TT_FBSupport5KSourceSize" = "发现于 AppleIntelFramebuffer::enableController.\r由AppleIntelFramebuffer::ValidateSourceSize。\r设置此 Bit 将最大源大小从 4096x4096 增加到 5120x5120。\r最大可能通过 Intel HD 支持5K。";
"TT_FBUnknownZeroFlags" = "";
// Connector Info ToolTips
"TT_Index" = "注意，这真的很乱（请参阅 AppleIntelFramebufferController::MapFBToPort）。\r我不完全确定为什么会存在这种情况，但我建议将索引设置为数组索引（即从 0 开始的序列）。\r\r唯一可接受的值为 0, 1, 2, 3 和 -1（0xFF）。当索引号等于数组索引时，逻辑很简单：\r索引为 0 的端口始终被认为是内置的（LVDS 类型）而不管其他任何值。\r根据类型检查索引为 1~3 的端口，HDMI 将被允许输出数字音频，否则会被默认假设为 DP。\r索引为 0xFF 的端口会被忽略并被跳过。\r\r当索引不等于数组索引端口类型，默认将从接口 [索引] 确定类型。\r假设读取时，我们有2个活动端口：\r0  -  [1] 总线 ID 4，类型 LVDS\r1  -  [2] 总线 ID 5，类型 DP\r2  -  [3] 总线 ID 6，类型 HDMI\r3  -  [-1] 总线 ID 0，类型 不存在\r这将导致 2 个缓冲帧类型将被移位：\r0  -  总线 ID 4，类型 DP\r1  -  总线 ID 5，类型 HDMI\r实际上 总线 ID 值也被读取为接口 [索引] 总线 ID，但会稍后通过\rAppleIntelFramebufferController::getGMBusIDfromPort 映射回来具有指定索引的接口。\r一旦找到特殊标记的接口（-1），查找将立即停止。为了说明，如果我们有 2 个活动端口：\r0  -  [1] 总线 ID 4，类型 LVDS\r1  -  [2] 总线 ID 5，类型 DP\r2  -  [-1] 总线 ID 6，类型 HDMI\r3  -  [-1] 总线 ID 0，类型 不存在\r结果就是第 2 个缓冲帧其类型和第二个总线 ID 将被移位：\r0  -  总线 ID 4，类型 DP\r1  -  总线 ID 6，类型 HDMI\r它也同时用于端口号计算。\r- LVDS 显示（更确切地说，标识符为 CNConnectorAlwaysConnected 的接口）获取端口号0。\r-其他显示通过索引 - 端口号映射：1到5，2到6，3到7 或回退到 0。";
"TT_BusID" = "通过 AppleIntelFramebufferController::MapFBToPort 证明，用于调用 AppleIntelFramebufferController::getGMBusIDfromPort。\r这是在 https://01.org/sites/default/files/documentation/intel-gfx-prm-osrc-hsw-display_0.pdf 中描述的 GMBUS（图形管理总线）ID\r使用方法可以在 英特尔 Linux 显卡驱动 源代码中找到：\rhttps：//github.com/torvalds/linux/blob/6481d5ed076e69db83ca75e751ad492a6fb669a7/drivers/gpu/drm/i915/intel_i2c.c ＃L43\rhttps：//github.com/torvalds/linux/blob/605dc7761d2701f73c17183649de0e3044609817/drivers/gpu/drm/i915/i915_reg.h#L3053\r但是，应该注意的是 Apple 标识符与 Linux 驱动程序略有不同。在Linux 中 0 意味着禁用，但是，对于 Apple 它具有一些特殊含义并用于内部显示。\r 除此之外其他值相同：\r- GMBUS_PIN_DPC（4）HDMIC\r-GMBUS_PIN_DPB（5）SDVO，HDMIB\r- GMBUS_PIN_DPD（6）HDMID\r-GMBUS_PIN_VGADDC（2）VGA 直到 Broadwell 都包含。\r一般你可以将 4, 5, 6 用于任意 HDMI 或 DisplayPort 显示。\r从 5 开始支持SDVO（https://en.wikipedia.org/wiki/Serial_Digital_Video_Out），它也可用于支持 DVI 显示。\r要启用 Skylake VGA 也可通过 SDVO 使其工作（而不是专用的GMBUS_PIN_VGADDC ID）。";
"TT_Pipe" = "似乎像 Piker 说的那样用于分组端口，但我找不到用法。";
"TT_Type" = "有效类型：\r-0\r-不存在（总是和不存在的接口同时工作，似乎有时用作 VGA）\r- LVDS（就像 AMD LVDS 用于 eDP 一样）\r- 数字 DVI（这不是 eDP，尽管经常被误解）\r- SVID\r- VGA\r- DP\r- HDMI\r- 模拟 DVI。";
"TT_Flags" = "这些是接口标识符，它们与延迟无关，无论 Piker 说什么。\r我试图在接口标识符中描述一些。";
// Connector Flags ToolTips
"TT_CNAlterAppertureRequirements" = "让 apperture memory 成为非必要项 AppleIntelFramebuffer::isApertureMemoryRequired";
"TT_CNUnknownFlag_2" = "";
"TT_CNUnknownFlag_4" = "";
"TT_CNConnectorAlwaysConnected" = "通常被设在 LVDS 显示器上（比如内建显示器）";
"TT_CNUnknownFlag_10" = "";
"TT_CNUnknownFlag_20" = "";
"TT_CNDisableBlitTranslationTable" = "禁用 blit 翻译表? AppleIntelFramebufferController::ConfigureBufferTranslation";
"TT_CNUseMiscIoPowerWell" = "Used in AppleIntelFramebufferController::setPowerWellState\rActivates MISC IO power well (SKL_DISP_PW_MISC_IO)";
"TT_CNUsePowerWell2" = "Used in AppleIntelFramebufferController::setPowerWellState\rActivates Power Well 2 usage (SKL_PW_CTL_IDX_PW_2)\rMay help with HDMI audio configuration issues\rREF: https://github.com/acidanthera/bugtracker/issues/1189";
"TT_CNUnknownFlag_200" = "";
"TT_CNUnknownFlag_400" = "";
"TT_CNUnknownFlag_800" = "";
"TT_CNUnknownFlag_1000" = "";
"TT_CNUnknownFlag_2000" = "";
"TT_CNUnknownFlag_4000" = "";
"TT_CNUnknownFlag_8000" = "";
"TT_CNUnknownZeroFlags" = "";
// Patch / Connectors
"Connector Info:" = "接口信息：";
"Index" = "索引";
"Bus ID" = "总线 ID";
"Pipe" = "通道";
"Type" = "类型";
"Flags" = "标识符";
"Connector Flags:" = "接口标识符：";
"Display Info:" = "显示信息：";
"Internal" = "内建";
"External" = "外接";
"Name" = "名称";
"Port" = "接口";
"Product ID" = "产品 ID";
"Serial No." = "序列号";
"Internal" = "内建";
"EDID" = "EDID";
// Patch / Patch
"Patch Options:" = "补丁选项：";
"General" = "通用";
"Advanced" = "高级";
"KextsToPatch (Hex)" = "KextsToPatch (16 进制)";
"KextsToPatch (Base64)" = "KextsToPatch (Base64)";
"DeviceProperties" = "设备属性";
"iASL DSL Source" = "iASL DSL 源";
"Bootloader:" = "引导工具：";
"Auto Detect" = "自动侦测";
"Clover" = "Clover";
"OpenCore" = "OpenCore";
"Auto Detect Changes" = "自动侦测变化";
"All" = "全部";
"EDID" = "EDID";
"Graphic Device" = "图形卡";
"Audio Device" = "音频";
"PCI Devices" = "PCI 设备";
"Use AllData Method" = "使用完整数据方法";
"General Patch" = "通用补丁";
"Patch Output:" = "补丁输出：";
"DVMT pre-alloc 32 MB" = "DVMT 32MB 预分配";
"Disable eGPU" = "禁用 eGPU";
"DP -> HDMI" = "将 DP 映射到 HDMI";
"Use Intel HDMI" = "使用英特尔 HDMI";
"Hotplug Reboot Fix" = "修复热插拔重启";
"DPCD Max Link Rate:" = "DPCD 最大链路值:";
"HDMI Infinite Loop Fix" = "HDMI 无限循环修复";
"Spoof Audio Device ID" = "仿冒声卡 ID";
"Spoof Video Device ID:" = "仿冒图形卡 ID: ";
"VRAM 2048 MB" = "显存 2048MB";
"Enable HDMI20 (4K)" = "启用 HDMI20 (4K)";
"GfxYTile Fix" = "修复 GfxYTile";
"USB Port Limit" = "USB 端口数限制";
"Framebuffer Port Limit:" = "缓冲帧端口数限制：";
"Enable Driver" = "启用驱动程序";
"Connector Index:" = "接口:";
"Preferred Mode:" = "首选模式:";
"LS (DP to HDMI 1.4)" = "LS (DP 转 HDMI 1.4)";
"PCON (DP to HDMI 2.0)" = "PCON (DP 转 HDMI 2.0)";
"Generate Patch" = "生成补丁";
// Bootloader
"Bootloader Info:" = "引导工具信息：";
"Current Booted Version" = "当前启动时使用的版本";
"Last Installed Version" = "上一次安装的版本";
"Latest Available Version" = "最新可用的版本";
"Patches" = "引导工具补丁";
"Select" = "选择";
"Type" = "类型";
"Comment" = "补丁注释";
"Download Bootloader" = "下载引导工具";
"Refresh Bootloader" = "刷新引导工具";
"Apply Bootloader Patches" = "应用引导工具补丁";
// NVRAM
"NVRAM Variables" = "NVRAM 变量";
"Variable Value" = "变量值";
"Add" = "添加";
// Extensions
"Installed Kexts:" = "已安装的驱动：";
"Select" = "选择";
"Installed" = "已安装的版本";
"Current" = "当前版本";
"Download" = "可下载";
"Replaced By" = "被合并入";
"Description" = "描述";
"Url" = "Url 链接";
"Compile Output" = "编译输出";
"Show Installed Only" = "仅显示已安装";
"Update Available" = "更新可用";
"Update Version Info" = "更新版本信息";
"Download Selected" = "下载选中项";
"Compile Selected" = "编译选中项";
"Install Kext(s)" = "安装驱动";
"Rebuild KextCache and Repair Permissions" = "重建缓存并修复权限";
// Displays
"Displays:" = "显示器：";
"Name" = "名称";
"Vendor ID" = "供应商 ID";
"Product ID" = "产品 ID";
"Serial No." = "序列号";
"Internal" = "内建";
"Scaled Resolutions" = "缩放分辨率";
"Width" = "宽";
"Height" = "高";
"Type" = "类型";
"Inject EDID:" = "注入 EDID：";
"Icon:" = "图标：";
"Default" = "默认";
"iMac" = "iMac";
"MacBook" = "MacBook";
"MacBook Pro" = "MacBook Pro";
"LG Display" = "LG 显示器";
"Resolution:" = "分辨率：";
"1080p" = "1080p";
"2K" = "2K";
"Manual" = "手动";
"Fix Monitor Ranges" = "修正显示范围";
"Inject Apple Info" = "注入苹果公司信息";
"Force RGB Mode" = "强制 RGB 模式";
"Patch Color Profile" = "为颜色预设文件注入补丁";
"Add Resolution" = "添加分辨率";
"Delete Resolution" = "删除分辨率";
"Refresh" = "刷新";
"Export" = "导出";
// Audio
"Audio Devices:" = "音频设备：";
"Sub Device" = "子设备";
"Revision" = "修订值";
"Pin Configuration" = "节点配置";
"NID" = "节点";
"PinDefault" = "默认配置";
"Gross Location" = "插孔";
"Geometric Location" = "插孔位置";
"In" = "输入";
"Out" = "输出";
"Color" = "颜色";
"Unknown" = "未知";
"Black" = "黑";
"Gray" = "灰";
"Blue" = "蓝";
"Green" = "绿";
"Red" = "红";
"Orange" = "橙";
"Yellow" = "黄";
"Purple" = "紫";
"Pink" = "粉";
"Reserved1" = "无效保留 1";
"Reserved2" = "无效保留 2";
"White" = "白";
"Other" = "其他";
"Jack Detect Override" = "覆盖插孔检测";
"Reserved" = "无效保留";
"Line Out" = "线路输出";
"Speaker" = "扬声器";
"HP Out" = "耳机输出";
"CD" = "CD";
"SPDIF Out" = "SPDIF 输出";
"Digital Other Out" = "其它数字输出";
"Modem Line Side" = "线路调制解调器";
"Modem Handset Side" = "耳麦调制解调器";
"Line In" = "线路输入";
"AUX" = "辅助";
"Mic In" = "麦克风输入";
"Telephony" = "电话";
"SPDIF In" = "SPDIF 输入";
"Digital Other In" = "其它数字输入";
"1/8\" Stereo/Mono" = "1/8\" 立体声/单声道";
"1/4\" Stereo/Mono" = "1/4\" 立体声/单声道";
"ATAPI Internal" = "内建 ATAPI";
"RCA" = "RCA";
"Optical" = "光纤";
"Other Digital" = "其它数字";
"Other Analog" = "其它模拟";
"Multichannel Analog" = "多声道模拟";
"XLR/Professional" = "卡侬/专业";
"RJ-11 (Modem)" = "RJ-11 (调制解调器)";
"Combination" = "混合";
"Jack" = "插孔";
"No Connection" = "未连接";
"Fixed" = "固定";
"Jack + Internal" = "插孔 + 内建";
"N/A" = "无";
"Rear" = "后面";
"Front" = "前面";
"Left" = "左面";
"Right" = "右面";
"Top" = "顶部";
"Bottom" = "底部";
"Special" = "特殊";
"External" = "外接";
"Internal" = "内建";
"Separate" = "独立";
"Rear Panel" = "后面板";
"Riser" = "扩展卡";
"Mobile Lid-Inside" = "移动设备 盖子中";
"Drive Bay" = "驱动器托架";
"Digital Display" = "数字显示器";
"Mobile Lid-Outside" = "移动设备 盖子外";
"ATAPI" = "ATAPI";
"BTL" = "BTL";
"EAPD" = "EAPD";
"L/R Swap" = "L/R 调换";
"Audio Info" = "声音信息";
"Controller" = "控制器";
"Vendor" = "供应商";
"Codec Name" = "Codec 名称";
"Codec Vendor" = "Codec 生产商";
"Audio Vendor" = "声卡生产商";
"ALC Layout ID" = "ALC Layout ID";
"Revisions" = "修订值：";
"Min Kernel" = "最低核心";
"Max Kernel" = "最高核心";
"AFG Low Power State" = "AFG 低压模式";
"Codec ID" = "Codec ID";
"Config Data" = "配置信息";
"Func Group" = "功能组";
"Codec" = "Codec";
"Wake Verb Reinit" = "支持 EAPD 唤醒";
"Layout ID" = "Layout ID";
"Boot Config Data" = "使用的 Config Data";
"Info" = "信息";
// USB
"USB Controllers:" = "USB 控制器：";
"ID" = "ID";
"Name" = "名称";
"Series" = "芯片组";
"Device ID" = "设备 ID";
"Vendor ID" = "供应商 ID";
"USB Ports" = "USB 接口";
"Name" = "名称";
"Connector" = "连接器";
"Location ID" = "位置 ID";
"Port" = "接口";
"Dev Speed" = "连接速率";
"Device" = "设备";
"Info" = "信息";
"Delete" = "删除";
"Clear All" = "清空全部";
"Refresh" = "刷新";
"Import" = "导入";
"Export" = "导出";
"Active Port" = "活动的端口";
// Disks
"EFI Partitions:" = "EFI 分区：";
"Device Name" = "设备名称";
"Partition Scheme" = "分区图";
"Volume Name" = "宗卷名称";
"BSD Name" = "BSD 名称";
"Mount Point" = "装载点";
"Disk Type" = "磁盘类型";
"Mount" = "装载";
"Unmount" = "卸载";
"Open" = "打开";
"Boot EFI" = "EFI 引导分区";
// PCI
"PCI Devices:" = "PCI 设备：";
"Debug" = "Debug";
"Vendor" = "供应商";
"Sub Vendor" = "子供应商";
"Sub Device" = "子设备";
"Vendor Name" = "供应商名称";
"Device Name" = "设备名称";
"Class" = "类型";
"Subclass" = "子类型";
"IOReg Name" = "IOReg 名称";
"IOReg IOName" = "IOReg IO名称";
"Device Path" = "设备地址";
// Power
"Power Info:" = "电源信息：";
"Fix sleepimage" = "修复深度休眠预留空间";
// Calculator
"Sequence" = "字符串转换";
"Hex:" = "16 进制：";
"Hex (reversed):" = "16 进制(逆向)：";
"Base64:" = "Base64 :";
"ASCII:" = "ASCII :";
"Value" = "值";
"Decimal:" = "10 进制：";
"Octal:" = "8 进制：";
"Binary:" = "2 进制：";
// Tools
"Tools Output:" = "工具输出：";
"Get AppleIntelInfo" = "从 AppleIntelInfo 中获取";
"Install Kext for Atheros AR92xx/93xx WLan Cards (only 10.14+)" = "为高通 Atheros AR92XX/93XX 无线网卡安装驱动 （仅用于 10.14+）";
"Install Kext to enable SATA HotPlug on Mojave" = "安装驱动以在 Mojave 上启用 SATA 热插拔";
"Generate Windows Bluetooth Registry File" = "生成 Windows 蓝牙注册表文件";
"Generate Windows UTC Registry Files" = "生成 Windows UTC 时间同步注册表文件";
"Disable Gatekeeper and mount the disk in read/write mode" = "禁用 Gatekeeper 并将磁盘挂载为读/写模式";
"Dump ACPI" = "导出 DSDT";
"Dump ACPI Tables" = "导出 ACPI 表";
"Choose a destination folder" = "选择目标文件夹";
"AppleIntelInfo Settings:" = "AppleIntelInfo 设置：";
"Log:" = "Log:";
"Enable HWP" = "启用 HWP";
"CStates" = "CStates 低压模式";
"IGPU" = "英特尔核显";
"IPG Style" = "IPG 类型";
"Intel Regs" = "英特尔寄存器";
"MSRs" = "MSRs";
"Select Destination" = "选择目标文件夹";
// Log
"Boot" = "引导";
"Lilu" = "Lilu";
"System" = "系统";
"Process:" = "进程:";
"Contains:" = "包含:";
"Log Options:" = "日志选项:";
"Last Boot" = "上次启动";
"Erase Log" = "清空日志";
"Disable Gatekeeper and mount the disk in read/write mode?" = "禁用 Gatekeeper 并将磁盘挂载为读/写模式?";
"This is required for some operations on macOS 10.15+" = "这对于 macOS 10.15+ 上的某些操作是必需的";
"Search (⌘F)" = "搜索 (⌘F)";
// Import KextsToPatch
"Import KextsToPatch" = "导入 KextsToPatch";
"Find:" = "查找：";
"Replace:" = "替换：";
"Cancel" = "取消";
"OK" = "确认";
// Bootloader Updater
"%@ Updated" = "%@已更新";
"Downloading %@" = "正在下载 %@";
"You are currently running the latest version of %@." = "当前没有新的%@版本可用！";
"A newer version of %@ is available (%@). You are currently running %@. Would you like to update?" = "有新版本的%@ %@ 可用 - 当前你使用的版本为 %@ 。 你想更新到更新的版本吗？";
"Not Now" = "现在不";
"Update..." = "更新...";
"Set %@ Installer Location" = "设置%@的安装路径";
"An error occured while trying to download %@ installer!" = "下载%@时出错！";
"%1.1f Mbytes" = "%1.1f MB";
// Misc
"You may require %@" = "你可能需要 %@";
"You may require Spoof Audio Device ID" = "你可能需要仿冒声卡的设备 ID";
"%@ %@-series Controller (0x%08X)" = "%@ %@-系 控制器 (0x%08X)";
"None" = "无";
"Importing KextsToPatch" = "正在导入 KextsToPatch";
"%@ Patch" = "%@ Patch";
"Are you sure you want to apply %d %@ patch(s)?" = "你确定要应用 %d 个%@补丁吗 ？";
"Patch Success!" = "补丁注入成功！";
"Patch Fail!" = "补丁注入失败！";
"Please select your existing config.plist to overwrite.\nData is written non-destructively and a backup will be created first." = "请选择现有的 config.plist 进行覆盖。\n数据是以非破坏性方式写入的，而且会在进行操作之前自动备份文件。";
"No Changes Detected!\r" = "未侦测到任何变化！\r";
"Unknown" = "未知";
"Mount Boot EFI Partition?" = "装载 EFI 分区？";
"Your Boot EFI Partition is not mounted." = "你的 EFI 分区尚未装载。";
"Mount" = "装载";
"Cancel" = "取消";
"Buy me a Beer" = "请 Ben Baker 喝瓶啤酒吧！";
"Installing '%@'...\n" = "正在安装 '%@'...\n";
"Rebuilding KextCache and Repairing Permissions...\n" = "正在重建缓存并修复权限...\n";
"\"%@\" doesn't exist. Do you want to create it?" = "\"%@\" 不存在。你希望创建它吗？";
"\"%@\" does not exist. You can create a new one." = "\"%@\" 不存在。你可以创建一个新的。";
"Warning!" = "警告！";
"Enabling HWP (Intel Speed Shift) will require a reboot to restore the previous value." = "启用 HWP (Intel Speed Shift) 需要重新启动来还原之前的值";
"Logging Intel registers may cause your system to crash." = "生成英特尔寄存器日志可能会让你的系统崩溃。";
"Logging CStates" = "生成 CStates 日志中";
"Perform CPU intensive activity..." = "执行 CPU 密集运算...";
"Fully Supported" = "完全支持";
"Not Supported" = "不支持";
"Configuration Error" = "配置错误";
"Decoder Failed" = "解码失败";
"Unknown Status (%@)" = "未知状态 (%@)";
"Update PCIIDs" = "更新 PCI ID";
"PCIIDs Update" = "PCI ID 更新";
"Successful!" = "成功！";
"Failure!" = "失败！";
"Missing or incompatible nasm!" = "nasm 缺少或者不兼容！";
"Click OK to run installation." = "点按确定来安装。";
"Snap"="创建快照";
